let questions = [
    {
        question: "ما هي العقيدة؟",
        answers: [
            { text:" هي الإيمان بالله وملائكته وكتبه ورسله واليوم الآخر والقدر خيره وشره", correct: true },
            { text: "العقدة أو الربطة", correct: false },
            { text: "شيء لا يهتم له المسلم", correct: false },
        ],
        proof: "قال عمر بن الخطاب: بينما نحن جلوس عند رسول الله ﷺ ذات يومٍ إذ طلع علينا رجلٌ شديد بياض الثياب، شديد سواد الشعر، لا يُرى عليه أثر السفر، ولا يعرفه منا أحد، حتى جلس إلى النبي ﷺ، فأسند ركبتيه إلى ركبتيه، ووضع كفيه على فخذيه، وقال: يا محمد، أخبرني عن الإسلام، فقال رسولُ الله ﷺ: الإسلام أن تشهد أن لا إله إلا الله، وأن محمدًا رسول الله، وتُقيم الصلاة، وتُؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعتَ إليه سبيلًا، قال: صدقتَ، فعجبنا له: يسأله ويُصدقه. قال: فأخبرني عن الإيمان، قال: أن تُؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خيره وشره، قال: صدقتَ، قال: فأخبرني عن الإحسان، قال: أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك، قال: فأخبرني عن الساعة، قال: ما المسؤول عنها بأعلم من السائل، قال: فأخبرني عن أماراتها، قال: أن تلد الأمةُ ربَّتها، وأن ترى الحُفاة العُراة العالة رعاء الشاء يتطاولون في البنيان، ثم انطلق، فلبثتُ مليًّا، ثم قال: يا عمر، أتدري من السائل؟ قلت: الله ورسوله أعلم، قال: فإنه جبريل أتاكم يُعلمكم دينَكم. رواه مسلم."
    },
    {
        question: "من أين تُؤخذ العقيدة؟",
        answers: [
            { text: "من العقول والأهواء", correct: false },
            { text: "من القرآن والسنة", correct: true },
            { text: "من تأويل النصوص وتحريفها", correct: false },
            
        ],
        proof: "أوْفى القرآن الكريم في بيان العقيدة وتصحيحها في النفوس، على أتم وجه وأكمله، وبخاصة في السور المكية، إجمالا وتفصيلا، قال الله تعالى: {وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِّكُلِّ شَيْءٍ}(النحل:89). قال ابن كثير: قال ابن مسعود: قد بين لنا في هذا القرآن كل علم، وكل شيء. وقال السعدي: في أصول الدين وفروعه، وفي أحكام الدارين وكل ما يحتاج إليه العباد. وقال الله سبحانه: {إِنَّ هَذَا الْقُرْآنَ يِهْدِي لِلَّتِي هِيَ أَقْوَمُ}(الإسراء:9).قال السعدي: أي: أعدل وأعلى من العقائد والأعمال والأخلاق، فمن اهتدى بما يدعو إليه القرآن كان أكمل الناس وأقومهم وأهداهم في جميع أموره. وقال تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُواْ أَطِيعُواْ اللّهَ وَأَطِيعُواْ الرَّسُولَ وَأُوْلِي الأَمْرِ مِنكُمْ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللّهِ وَالْيَوْمِ الآخِرِ ذَلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلاً}(النساء:59)"
    },
    {
        question: "كيف تُفهم العقيدة؟",
        answers: [
            { text: "باتباع المعاصرين ولو أخطؤا", correct: false },
            { text: "بمزاجنا وعقولنا", correct: false },
            { text: "كما فهما الصحابة والتابعين ونابعي التابعين", correct: true },
            
        ],
        proof: "مدح الله سبحانه وتعالى الصحابة قائلاً: ﴿ الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ أَعْظَمُ دَرَجَةً عِندَ اللَّهِ ۚ وَأُولَٰئِكَ هُمُ الْفَائِزُونَ﴾[ التوبة: 20], وقال: ﴿ وَالسَّابِقُونَ الْأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالْأَنصَارِ وَالَّذِينَ اتَّبَعُوهُم بِإِحْسَانٍ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ﴾[ التوبة: 100], وقال صلى الله عليه وسلم:  فإنَّه مَن يَعِشْ منكم فسيَرَى اختِلافًا كثيرًا، فعليكم بسُنَّتي وسُنَّةِ الخُلَفاءِ الرَّاشِدينَ المَهْدِيِّينَ، عَضُّوا عليها بالنَّواجِذِ، وإيَّاكم ومُحدَثاتِ الأُمورِ؛ فإنَّ كُلَّ بِدعةٍ ضَلالةٌ, وقال :خيرُ القرونِ قرْني, ثمَّ الَّذين يلونَهم, ثمَّ الَّذين يلونَهم. "
    },
    {
        question: "أين الله؟",
        answers: [
            { text: "لا مكان", correct: false },
            { text: "في السماء مستوٍ على عرشه", correct: true },
            { text: "كل مكان", correct: false },
            
        ],
        proof: "قال أَأَمِنتُمْ مَنْ فِي السَّمَاءِ أَنْ يَخْسِفَ بِكُمُ الأَرْضَ فَإِذَا هِيَ تَمُورُ * أَمْ أَمِنتُمْ مَنْ فِي السَّمَاءِ أَنْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ [الملك:16-17] وقال -جل وعلا-: الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى [طه:5] وقال سبحانه: إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَوَاتِ وَالأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَى عَلَى الْعَرْشِ [الأعراف:54]. فهو فوق العرش في جهة العلو، فوق جميع الخلق، عند جميع أهل العلم من أهل السنة، قد أجمع أهل السنة والجماعة -رحمة الله عليهم- على أن الله في السماء فوق العرش فوق جميع الخلق، وهذا هو المنقول عن رسول الله ﷺ وعن أصحابه وعن أتباعهم بإحسان، كما أنه موجود في كتاب الله القرآن. وقد سأل النبي ﷺ جارية جاء بها سيدها ليعتقها، فقال لها الرسول ﷺ: أين الله؟ قالت: في السماء، قال: من أنا؟ قالت: أنت رسول الله، قال: أعتقها، فإنها مؤمنة رواه مسلم في الصحيح، فالرسول ﷺ أقر هذه الجارية على الجواب، الذي قلته أنت، قال لها: أين الله؟ قالت: في السماء، قال: من أنا؟ قالت: أنت رسول الله، قال: أعتقها، فإنها مؤمنة وما ذاك إلا لأن إيمانها بأن الله في السماء يدل على إخلاصها لله، وتوحيدها لله، وأنها مؤمنة به سبحانه، وبعلوه فوق جميع خلقه، وبرسوله محمد -عليه الصلاة والسلام- حيث قالت: أنت رسول الله."
    },
    {
        question: "ما هو القرآن؟",
        answers: [
            { text: "شعر ", correct: false },
            { text: "قول بشر", correct: false },
            { text: "كلام الله تعالى", correct: true },
            
        ],
        proof: "قال سبحانه: وَإِنْ كُنْتُمْ فِي رَيْبٍ مِمَّا نَزَّلْنَا عَلَى عَبْدِنَا فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ وَادْعُوا شُهَدَاءَكُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ {البقرة:23}.  قال الله تعالى: قُلْ لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَى أَنْ يَأْتُوا بِمِثْلِ هَذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا {الإسراء:88}، وقال أيضًا: أَمْ يَقُولُونَ افْتَرَاهُ قُلْ فَأْتُوا بِعَشْرِ سُوَرٍ مِثْلِهِ مُفْتَرَيَاتٍ وَادْعُوا مَنِ اسْتَطَعْتُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ {هود:13}. وقال عزَّ من قائل: إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ {الحجر:9}. ال عزَّ من قائل: أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا {النساء:82}، وقال أيضًا: إِنَّ الَّذِينَ كَفَرُوا بِالذِّكْرِ لَمَّا جَاءَهُمْ وَإِنَّهُ لَكِتَابٌ عَزِيزٌ * لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ {فصلت:41، 42}. وهو كلامه تعالى وصفة من صفاته عز وجل."
    },
    // {
    //     question: "ما معنى إله؟",
    //     answers: [
    //         { text: "الرب", correct: false },
    //         { text: "المعبود", correct: true },
    //         { text: "الرحيم", correct: false },
            
    //     ],
    //     proof: "،( وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ) [الأنبياء:25]"
    // },
    {
        question: "ما معنى لا إله إلا الله؟",
        answers: [
            { text: "لا معبود بحق إلا الله", correct: true },
            { text: "لا خالق إلا الله", correct: false },
            { text: "لا أعلم", correct: false },
            
        ],
        proof: "الإله أي المعبود ،( وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ) [الأنبياء:25]"
    },
    {
        question: "لماذا خلقنا الله؟",
        answers: [
            { text: "لكسب الرزق", correct: false },
            { text: "للهو", correct: false },
            { text: "للعبادة", correct: true },
            
        ],
        proof: "﴿ وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ﴾[ الذاريات: 56]"
    },
    {
        question: "حكم الحلف بغير الله؟",
        answers: [
            { text: "جائز", correct: false },
            { text: "شركٌ أصغر", correct: true },
            { text: "مكروه", correct: false },
            
        ],
        proof: " لا يجوز الحلف بغير الله كائنًا من كان -لا بالنبي ولا بغيره- يقول النبي ﷺ: من كان حالفًا فليحلف بالله أو ليصمت، وقال: لا تحلفوا بآبائكم ولا بأمهاتكم، ولا بالأنداد، ولا تحلفوا بالله إلا وأنتم صادقون، وقال ﷺ: من حلف بشيء دون الله فقد أشرك أخرجه الإمام أحمد بإسناد صحيح عن عمر ، وخرج أبو داود والترمذي بإسناد صحيح عن ابن عمر رضي الله عنهما عن النبي ﷺ أنه قال: من حلف بغير الله فقد كفر أو أشرك، وقال عليه الصلاة والسلام: من حلف بالأمانة فليس منا.والمقصود: أن الواجب الحلف بالله وحده، ولا يجوز الحلف بالنبي، ولا بغير النبي، ولا بالأمانة، ولا بالكعبة، ولا بغير ذلك"
    },
    {
        question: "حكم الاستغاثة ودعاء غير الله؟",
        answers: [
            { text: "مكروه", correct: false },
            { text: "شركٌ أكبر", correct: true },
            { text: "جائز", correct: false },
            
        ],
        proof: "يقول سبحانه: فَلا تَدْعُوا مَعَ اللَّهِ أَحَدًا [الجن:18] ويقول سبحانه: وَلا تَدْعُ مِنْ دُونِ اللَّهِ مَا لا يَنْفَعُكَ وَلا يَضُرُّكَ فَإِنْ فَعَلْتَ فَإِنَّكَ إِذًا مِنَ الظَّالِمِينَ [يونس:106] يعني: المشركين.ويقول سبحانه: ذَلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ وَالَّذِينَ تَدْعُونَ مِنْ دُونِهِ مَا يَمْلِكُونَ مِنْ قِطْمِيرٍ ۝ إِنْ تَدْعُوهُمْ لا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ [فاطر:14] سماه: شرك، سمى دعاءهم إياه شركاً بالله سبحانه وتعالى، وقال : وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لا بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِنْدَ رَبِّهِ إِنَّهُ لا يُفْلِحُ الْكَافِرُونَ [المؤمنون:117] فسماهم كفرة بالدعاء، والمدعو من دون الله يسمى إله، ويسمى نداً"
    },
    // {
    //     question: "ما عدد أركان الإيمان؟",
    //     answers: [
    //         { text: "5", correct: false },
    //         { text: "4", correct: false},
    //         { text: "6", correct: true },
            
    //     ],
    //     proof: "حديث عمر ذكر كاملاً في الدليل للسؤال الأول" 
    // },
    {
        question: "ما هي أعظم الواجبات؟",
        answers: [
            { text: "التوحيد", correct: true },
            { text: "الصدقة", correct: false },
            { text: "بر الوالدين", correct: false },
            
        ],
        proof: "عن معاذ بن جبل رضي الله عنه أن النبي صلى الله عليه وسلم قال: (يا مُعاذ، أتَدْرِي ماحَقُّ اللَّه على العِباد؟ قال: اللَّهُ ورَسولُهُ أعْلم، قال: أنْ يَعْبُدُوه ولا يُشْرِكُوا به شيئا) رواه البخاري. وعن عبد الله بن عباس رضي الله عنه قال: (لَمَّا بَعَثَ النبيُّ صلي الله عليه وسلم مُعَاذ بن جبَلٍ إلى نَحْوِ أهْلِ اليمن قال له: إنَّكَ تَقْدَمُ علَى قَوْمٍ مِن أهْلِ الكِتَاب، فَلْيَكُنْ أوَّلَ ما تَدْعُوهُمْ إلى أنْ يُوَحِّدُوا اللَّهَ تعالى، فإذا عرفوا ذلك، فأخْبِرْهُمْ أنَّ اللَّه قدْ فرَضَ عليهم خمس صلواتٍ في يومهم وليْلتهم) رواه البخاري."
    },
    {
        question: "ما هو أعظم الذنوب؟",
        answers: [
            { text: "الزنا", correct: false },
            { text: "أكل مال اليتيم بالباطل", correct: false },
            { text: "الشرك بالله", correct: true },
            
        ],
        proof: "﴿ إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ ۚ وَمَن يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا﴾[ النساء: 116] وقال عليه الصلاة والسلام لما سئل:أيُّ الذنبِ أعظمُ قال: أن تجعلَ للهِ نِدًّا وهو خلقكَ "
    },
    {
        question: "ما هي الملائكة؟",
        answers: [
            { text: "من البشر", correct: false },
            { text: "عباد مكرمون خلقهم الله من النور", correct: true },
            { text: "من الجن", correct: false },
            
        ],
        proof: " قال تعالى عنهم: بِأَيْدِي سَفَرَةٍ (15) كِرَامٍ بَرَرَةٍ (16)[سورةعبس] وكما في الحديث الصحيح: خلقت الملائكة من النور، وخلق آدم مما وصف لكم من الطين، وخلق الشيطان من مارج من نار"
    },
    // {
    //     question: "من ماذا خلقت الشيطان؟",
    //     answers: [
    //         { text: "طين", correct: false },
    //         { text: "من مارج من نار", correct: true },
    //         { text: "نور", correct: false },
            
    //     ],
    //     proof: "قال تعالى عن إبليس: (قال أنا خير منه خلقتني من نار وخلقته من طين) [ص: 76] وفي الحديث: وخلق الجان من مارج من نار."
    // },
    // {
    //     question: "ما هي العبادة؟",
    //     answers: [
    //         { text: "أفعال لا معنى لها", correct: false },
    //         { text: "أقوال جيدة", correct: false },
    //         { text: "كل ما يحبه الله ويرضاه من الأقوال والأعمال الظاهرة والباطنة", correct: true },
            
    //     ],
    //     proof: "وهي بالمعنى العام كلمة جامعة شاملة لكل ما يحبه الله تعالى من الأقوال والأفعال الظاهرة والباطنة. كما عرفها شيخ الإسلام ابن تيمية."
    // },
    {
        question: "ما أقسام التوحيد؟",
        answers: [
            { text: "توحيد الربوبية/ توحيد الألوهيه/ توحيد الأسماء والصفات", correct: true },
            { text: "الإسلام/ الإيمان", correct: false },
            { text: "الإحسان/ والعباده", correct: false },
            
        ],
        proof: " قال سبحانه: اللَّهُ خَالِقُ كُلِّ شَيْءٍ[الرعد:16] وقوله: وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ[البينة:5]  كما قال: وَلِلَّهِ الأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا[الأعراف:180] والأدلة كثيرة جداً لا يسعني ذكرها جميعها ومن قرأ القرآن بتدبر وجدها! "

    },
    {
        question: "ما شروط قبول العبادة؟",
        answers: [
            { text: "أن تكون أمام الناس", correct: false },
            { text: "أن يكون خالصاً لله تعالى لا يقصد به إلا وجهه/ أن يكون مما شرعه الله", correct: true },
            { text: "أن تكون كثيرة", correct: false },
            
        ],
        proof: "دل على هذا قول الله تعالى: فَمَنْ كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا [الكهف: 110]، فلا بد أن يسلم العمل من الرياء المنافي للإخلاص، ومن البدعة المضادة للسنة "
    },
    {
        question: "ما هي القرون المفضلة؟",
        answers: [
            { text: "القرن ال19 و18 و20", correct: false },
            { text: "القرون ال3 الأولى بعد النبي", correct: true },
            { text: "القرون بعد آدم عليه السلام", correct: false },
            
        ],
        proof: "قال ﷺ:خيرُ القرونِ قرْني, ثمَّ الَّذين يلونَهم, ثمَّ الَّذين يلونَهم."
    },
    // {
    //     question: "من خاتم الأنبياء والرسل؟",
    //     answers: [
    //         { text: "عيسىﷺ", correct: false },
    //         { text: "محمدﷺ", correct: true },
    //         { text: "نوحﷺ", correct: false },
            
    //     ],
    //     proof: "  قال الله تعالى: {مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلَكِنْ رَسُولَ اللهِ وَخَاتَمَ النَّبِيِّينَ وَكَانَ اللهُ بِكُلِّ شَيْءٍ عَلِيمًا}(الأحزاب:40). قال ابن كثير: فهذه الآية نَصٌ في أنه لا نبي بعده عن محمد بن جبير بن مطعم عن أبيه رضي الله عنهما قال: سمعتُ رسول الله صلى الله عليه وسلم يقول: (إن لي أسماء: أنا محمد، وأنا أحمد، وأنا الماحي الذي يمحو الله تعالى بي الكفر، وأنا الحاشر الذي يحشر الناس على قدمي، وأنا العاقب الذي ليس بعده نبي) رواه مسلم. عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إن مَثَلي ومَثَل الأنبياء من قبلي، كمثل رجل بنى بيتًا فأحْسَنه وأجمله، إلا موضِع لَبِنة من زاوية، فجعل الناس يطوفون به ويَعجَبون له، ويقولون: هلا وُضِعتْ هذه اللبنة! قال: فأنا اللبنة، وأنا خاتم النبيين) رواه البخاري "
    // },
    // {
    //     question: "ما أعظم الكتب؟",
    //     answers: [
    //         { text: "التوراة", correct: false },
    //         { text: "الإنجيل", correct: false },
    //         { text: "القرآن", correct: true },
            
    //     ],
    //     proof: "ن تعهد الله بحفظه فقال: ﴿ إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ﴾[ الحجر: 9], وأن القرآن نسخ باقي الكتب لقوله تعالى: ﴿ وَأَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ الْكِتَابِ وَمُهَيْمِنًا عَلَيْهِ ۖ فَاحْكُم بَيْنَهُم بِمَا أَنزَلَ اللَّهُ ۖ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ عَمَّا جَاءَكَ مِنَ الْحَقِّ ۚ لِكُلٍّ جَعَلْنَا مِنكُمْ شِرْعَةً وَمِنْهَاجًا ۚ وَلَوْ شَاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً وَلَٰكِن لِّيَبْلُوَكُمْ فِي مَا آتَاكُمْ ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ إِلَى اللَّهِ مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُم بِمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ﴾[ المائدة: 48]."
    // },
    {
        question: "ما هو الدين الذي يدخل صاحبه الجنه بعد بعثة محمدﷺ؟",
        answers: [
            { text: "اليهودية", correct: false },
            { text: "الإسلام", correct: true },
            { text: "النصرانية", correct: false },
            
        ],
        proof: "﴿  إِنَّ الدِّينَ عِندَ اللَّهِ الْإِسْلَامُ ۗ وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۗ وَمَن يَكْفُرْ بِآيَاتِ اللَّهِ فَإِنَّ اللَّهَ سَرِيعُ الْحِسَابِ﴾ [ سورة آل عمران: 19] , ﴿ وَمَن يَبْتَغِ غَيْرَ الْإِسْلَامِ دِينًا فَلَن يُقْبَلَ مِنْهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ﴾[ سورة آل عمران: 85], و الذي نفْسُ محمدٍ بيدِهِ ، لا يسمعُ بي أحدٌ من هذه الأمةِ ، لا يهودِيٌّ ، و لا نصرانِيٌّ ، ثُمَّ يموتُ ولم يؤمِنْ بالذي أُرْسِلْتُ به ، إلَّا كان من أصحابِ النارِ"
    },
    {
        question: "ما أعظم العبادات بعد التوحيد؟",
        answers: [
            { text: "الصلاة", correct: true },
            { text: "الصيام", correct: false },
            { text: "الحج", correct: false },
            
        ],
        proof: " قَالَ رَسُولُ اللَّهِ ﷺ: أُمِرْتُ أَن أُقاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَن لا إِلهَ إِلاَّ اللَّه وأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، ويُقِيمُوا الصَّلاةَ، وَيُؤْتُوا الزَّكاةَ، فَإِذا فَعَلوا ذلكَ، عَصَمُوا مِنِّي دِمَاءَهُمْ وأَمْوَالَهم إِلاَّ بحَقِّ الإِسلامِ، وحِسابُهُمْ عَلى اللَّهِ مُتفقٌ عليه. وقال: العهد الذي بيننا وبينهم الصلاة، فمن تركها فقد كفر، وثبت عنه عليه الصلاة والسلام أيضاً أنه قال: بين الرجل وبين الكفر والشرك ترك الصلاة، أخرجه مسلم في صحيحه من حديث جابر"
    },
    {
        question: "ما حكم منكر سنة النبي؟",
        answers: [
            { text: "مبتدع", correct: false },
            { text: "كافر", correct: true },
            { text: "مسلم", correct: false },
            
        ],
        proof: "{ قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِی یُحۡبِبۡكُمُ ٱللَّهُ وَیَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ (31) قُلۡ أَطِیعُوا۟ ٱللَّهَ وَٱلرَّسُولَۖ فَإِن تَوَلَّوۡا۟ فَإِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡكَـٰفِرِینَ (32) }[ سورة آل عمران: 31-32]"
    },
    {
        question: "ما حكم دعاء الرسولﷺ؟",
        answers: [
            { text: "جائز", correct: false },
            { text: "شركٌ أكبر", correct: true },
            { text: "مكروه", correct: false },
            
        ],
        proof: "﴿ قُل لَّا أَمْلِكُ لِنَفْسِي نَفْعًا وَلَا ضَرًّا إِلَّا مَا شَاءَ اللَّهُ ۚ وَلَوْ كُنتُ أَعْلَمُ الْغَيْبَ لَاسْتَكْثَرْتُ مِنَ الْخَيْرِ وَمَا مَسَّنِيَ السُّوءُ ۚ إِنْ أَنَا إِلَّا نَذِيرٌ وَبَشِيرٌ لِّقَوْمٍ يُؤْمِنُونَ﴾[ الأعراف: 188], ﴿ قُلْ إِنِّي لَا أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا﴾[ سورة الجن: 21], كما قلنا سابقاً أن الدعاء عبادة لايجوز صرفها لغير الله."

    },
    // {
    //     question: "ما مراتب الدين؟",
    //     answers: [
    //         { text: "الإسلام/ الإيمان/ الإحسان", correct: true },
    //         { text: "الصيام", correct: false },
    //         { text: "الحج", correct: false },
            
    //     ],
    //     proof:"حديث جبريل في السؤال الأول",
    // },
    {
        question: "ما الإسلام؟",
        answers: [
            { text: "الإستسلام والخضوع لله", correct: true },
            { text: "الصيام", correct: false },
            { text: "الحج", correct: false },
            
        ],
        proof: "قال: يا محمد، أخبرني عن الإسلام، فقال رسولُ الله ﷺ: الإسلام أن تشهد أن لا إله إلا الله، وأن محمدًا رسول الله، وتُقيم الصلاة، وتُؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعتَ إليه سبيلًا، وقال تعالى :إنَّ الدِّينَ عِنْدَ اللَّهِ الإِسْلامُ[آل عمران:19] الإسلام يعني: الانقياد والذل لله بتوحيده والإخلاص له، وطاعة أوامره، وترك نواهيه"
    },
    {
        question: "ما الإيمان؟",
        answers: [
            { text: "الإستسلام والخضوع لله", correct: false },
            { text: "أن تعبد الله كأنك تراه فإن لم تكن تراه فإن الله يراك", correct: false },
            { text: "هو قول باللسان واعتقاد بالقلب وعمل بالجوارح يزيد بالطاعة وينقص بالمعصية", correct: true },
            
        ],
        proof: "فأخبرني عن الإيمان، قال: أن تُؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خيره وشره، قال: صدقتَ, لأدلة من القرآن الكريم على زيادة الإيمان ونقصانه:1 ـ قال الله تعالى: {إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ}(الأنفال:2) 2. قال تعالى: {الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُواْ لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَاناً وَقَالُواْ حَسْبُنَا اللهُ وَنِعْمَ الْوَكِيلُ}(آل عمران:173). 3. النبي صلى الله عليه وسلم قال: (لا يزني الزاني حين يزني وهو مؤمن، ولا يسرق السارق حين يسرق وهو مؤمن، ولا يشرب الخمر حين يشربها وهو مؤمن، ولا ينهب نُهبة ذات شرف يرفع الناس إليه فيها بأبصارهم حين ينتهبها وهو مؤمن) رواه البخاري."
    },
    {
        question: "ما الإحسان؟",
        answers: [
            { text: "الإستسلام والخضوع لله", correct: false },
            { text: "هو قول باللسان واعتقاد بالقلب وعمل بالجوارح يزيد بالطاعة وينقص بالمعصية", correct: false },
            { text: "أن تعبد الله كأنك تراه فإن لم تكن تراه فإن الله يراك ", correct: true },
            
        ],
        proof: "قال: فأخبرني عن الإحسان، قال: أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك"
    },
    {
        question: "ما البدعة؟",
        answers: [
            { text: "عمل حسن تؤجر عليه", correct: false },
            { text: "هي كل عبادة أحدثها الناس ليس لها أصل في الكتاب ولا في السنة ولا في عمل الخلفاء الأربعة الراشدين", correct: true },
            { text: "هو الإختراعات العلميه المفيدة", correct: false },
            
        ],
        proof: "البدعة في الشرع المطهر: هي كل عبادة أحدثها الناس ليس لها أصل في الكتاب ولا في السنة ولا في عمل الخلفاء الأربعة الراشدين، لقول النبي ﷺ: من أحدث في أمرنا هذا ما ليس منه فهو رد متفق على صحته، وقوله ﷺ: من عمل عملا ليس عليه أمرنا فهو رد أخرجه مسلم في صحيحه، وقوله ﷺ في حديث العرباض بن سارية : فعليكم بسنتي وسنة الخلفاء الراشدين المهديين من بعدي، تمسكوا بها وعضوا عليها بالنواجذ، وإياكم ومحدثات الأمور! فإن كل محدثة بدعة، وكل بدعة ضلالة رواه الإمام أحمد وأبو داود والترمذي وابن ماجة بسند صحيح، والأحاديث في هذا المعنى كثيرة."
    },
    {
        question: "حكم طاعة الرسول فيما أمر واجتناب ما نهى عنه وزجر؟",
        answers: [
            { text: "واجب", correct: true },
            { text: "محرم", correct: false },
            { text: "مباح", correct: false },
            
        ],
        proof: "الأدلة كثيرة جداً, قال تعالى: ﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ ۖ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا﴾[ النساء: 59]"
    },
    {
        question: "أي توحيد أقر به كفار قريش؟",
        answers: [
            { text: "الأسماء والصفات", correct: false },
            { text: "الألوهية", correct: false },
            { text: "الربوبية", correct: true },
            
        ],
        proof: " قُل لِّمَنِ الْأَرْضُ وَمَن فِيهَا إِن كُنتُمْ تَعْلَمُونَ (84) سَيَقُولُونَ لِلَّهِ ۚ قُلْ أَفَلَا تَذَكَّرُونَ (85) قُلْ مَن رَّبُّ السَّمَاوَاتِ السَّبْعِ وَرَبُّ الْعَرْشِ الْعَظِيمِ (86) سَيَقُولُونَ لِلَّهِ ۚ قُلْ أَفَلَا تَتَّقُونَ (87) قُلْ مَن بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَهُوَ يُجِيرُ وَلَا يُجَارُ عَلَيْهِ إِن كُنتُمْ تَعْلَمُونَ (88) سَيَقُولُونَ لِلَّهِ ۚ قُلْ فَأَنَّىٰ تُسْحَرُونَ (89)[المؤمنون]"
    },
    {
        question: "التصديق الجازم أن الله هو وحده المستحق للعبادة هو؟",
        answers: [
            { text: "الأسماء والصفات", correct: false },
            { text: "الألوهية", correct: true },
            { text: "الربوبية", correct: false },
            
        ],
        proof: "﴿ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ﴾[ سورة الفاتحة: 5]"
    },
    {
        question: "ما الكتاب الذي تعهد الله بحفظه؟",
        answers: [
            { text: "الأنجيل", correct: false },
            { text: "التوراة", correct: false },
            { text: "القرآن", correct: true },
            
        ],
        proof: "﴿ إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ﴾[ الحجر: 9]"
    },
    {
        question: "ما تفسير قوله تعالى:﴿ وَهُوَ اللَّهُ فِي السَّمَاوَاتِ وَفِي الْأَرْضِ ۖ يَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ وَيَعْلَمُ مَا تَكْسِبُونَ﴾",
        answers: [
            { text: "هو الإله المعبود في السموات والأرض. ومن دلائل ألوهيته أنه يعلم جميع ما تخفونه -أيها الناس- وما تعلنونه، ويعلم جميع أعمالكم من خير أو شر", correct: true },
            { text: "أنه في السماء والأرض", correct: false },
            { text: "أنه شديد العذاب ", correct: false },
            
        ],
        proof: " اسم الله معناه المألوه أي المعبود أو المستحق للعبادة لما اتصف به من صفات الألوهية التي هي صفات الكمال. من تفسير أسماء الله الحسنى للسعدي باختصار وتصرف"
    },
    {
        question: "كيف يتعامل أهل السنة مع صفات الله الحسنى من القرآن والسنة؟",
        answers: [
            { text: "ينفون بمقتضى عقولهم وأفكارهم ويحرفون الكلم عن مواضعه", correct: false },
            { text: "إثبات ما أثبته الله لنفسه من صفات الكمال أو أثبتها له نبيه", correct: true },
            { text: "السكوت عنها وتفويض معناها", correct: false },
            
        ],
        proof: "﴿ وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا ۖ وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ ۚ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ﴾[ الأعراف: 180]"
    },
    {
        question: "ما هو الدعاء؟",
        answers: [
            { text: "عبادة شرعها الله لعباده", correct: true },
            { text: "كلمات تقال", correct: false },
            { text: "الإمتناع عن الطعام والشراب", correct: false },
            
        ],
        proof: "قال سبحانه: ادْعُونِي أَسْتَجِبْ لَكُمْ [غافر:60]، وقال : وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ [البقرة:186]. "
    },
    {
        question: "كيف نتعامل مع أصحاب البدع؟",
        answers: [
            { text: "نتبعهم ونطيعهم", correct: false },
            { text: "نوقرهم ونجلهم", correct: false },
            { text: "نعرض عنهم وندعو لهم بالهداية", correct: true },
            
        ],
        proof: "قال أيضا عليه الصلاة والسلام في الحديث الصحيح: إياكم ومحدثات الأمور، فإن كل محدثة بدعة وكل بدعة ضلالة، وقال أيضاً عليه الصلاة والسلام: من أحدث في أمرنا هذا ما ليس منه فهو رد، أي: فهو مردود متفق على صحته, وقال ابن مسعود رضي الله عنه: اتبعوا ولا تبتدعوا, كما يجب على المسلم الإعراض عنهم حتى لا يزينوا له زخرف القول عروراً فيضلوه عن سبيل الله ويفتنوه عن دينه"
    },
    // {
    //     question: " ",
    //     answers: [
    //         { text: "", correct: false },
    //         { text: "", correct: true },
    //         { text: "", correct: false },
            
    //     ],
    //     proof: ""
    // },
    // {
    //     question: " ",
    //     answers: [
    //         { text: "", correct: false },
    //         { text: "", correct: true },
    //         { text: "", correct: false },
            
    //     ],
    //     proof: ""
    // },
];



let questionIndex=0
let score=0

function startQuiz(){
    questionIndex=0
    score=0
    displayQuestion()
}

function displayQuestion(){
    // let currentQuestion= questions[index]
    let questionNumber= questionIndex+1
    let questionCard=document.querySelector(".card")
    let qno = `${questionNumber}. ${questions[questionIndex].question}`
    let questionStatus =""
    let questionTemplate= `
            <h2 class="title">اختبار العقيدة</h2>
            <h3 class="qno">${qno}</h3>
            <div class="buttons">
                <button class="op" data-correct="${questions[questionIndex].answers[0].correct}">${questions[questionIndex].answers[0].text}</button><hr>
                <button class="op" data-correct="${questions[questionIndex].answers[1].correct}">${questions[questionIndex].answers[1].text}</button><hr>
                <button class="op" data-correct="${questions[questionIndex].answers[2].correct}">${questions[questionIndex].answers[2].text}</button>
                
            </div>
            
            <button class="next">التالي</button>
    `
    
    // if(questions[questionIndex].answers.length===2){
    //     questionCard.innerHTML=""
    //     questionCard.innerHTML= trueFalseTemplate
    // }
    // else{
    //     questionCard.innerHTML= questionTemplate
        
    // }

    questionCard.innerHTML= questionTemplate
    
    let nextButton= document.querySelector(".next")
    

    document.querySelectorAll(".op").forEach( button =>{

        button.addEventListener("click", function(e){

               if(e.target.getAttribute("data-correct")==="true"){
                   e.target.classList.add("true")
                   questionStatus="صحيحة!"
                   score++
                   button.classList.remove("op:hover");
               }
               else{
                   e.target.classList.add("false")
                   questionStatus="خاطئة!"
                   button.classList.remove("op:hover");
                   
                   document.querySelectorAll(".op").forEach(truebtn=>{

                            if(truebtn.getAttribute("data-correct")==="true"){
                                truebtn.classList.add("true")
                            }
                   })

                   
               }
               disableButtons()
               showNextButton(nextButton)
               displayProof(questionIndex, questionStatus)
               
            })
    })


    nextButton.addEventListener("click", function(){

        hideProof()
        if(questionIndex<questions.length-1){
            questionIndex++
            hideNextButton(nextButton)
            displayQuestion()
            
        }
        else{
            let finalScore= (score / questions.length)*100
            let feedback= finalScore>90 ? "ممتاز" : finalScore>70 ? "لا بأس" : "راجع معلوماتك"
            
            let resultTemplate= `
            <h2 class="title">انتهى الاختبار</h2>
            <h3 class="feedback">${feedback}</h3>
            <h3 class="qno" style="text-align: center;">حصلت على نتيجة: ${finalScore}%</h3>
            <button class="restart">إعادة</button>`

            questionCard.innerHTML=resultTemplate

            let feedbackElement = document.querySelector(".feedback");
            if (finalScore > 85) {
                feedbackElement.style.color = "rgb(31, 207, 31)";
            } else if (finalScore > 70) {
                feedbackElement.style.color = "rgb(247, 148, 36)";
            } else {
                feedbackElement.style.color = "rgb(228, 64, 45)";
            }

            let restartButton= document.querySelector(".restart")
            restartButton.style.display="block"
            restartButton.addEventListener("click", function(){
                restartButton.style.display="none"
                startQuiz()
            })
        }
    })

}

function disableButtons(){

    document.querySelectorAll(".op").forEach(button=>{
        button.disabled= true
    })
}

function hideNextButton(nextButton){
    nextButton.style.display="none"
}

function showNextButton(nextButton){
    nextButton.style.display="block"
}

let initialScrollY = 0;

function displayProof(questionIndex, questionStatus){
    let proofCard= document.querySelector(".proof")
    proofCard.style.display="flex"
    let proofTemplate=`
            
        <h2 class="title">الدليل</h2>
        <h3 class="qStatus" style="text-align:center">إجابتك ${questionStatus}</h3>
        <h3 class="qno">${questions[questionIndex].proof}</h3>
            
    `
    
    proofCard.innerHTML =proofTemplate

    let qstsColor= document.querySelector(".qStatus")
    if(questionStatus==="صحيحة!"){
        qstsColor.style.color= "rgb(31, 207, 31)"
    }
    else{
        qstsColor.style.color="rgb(228, 64, 45)"
    }

    setTimeout(() => {
        const navbarHeight = document.querySelector(".navbar")?.offsetHeight || 0; // Get navbar height
        const margin = 90; // Adjust margin as needed

        if (proofCard) {
            const elementRect = proofCard.getBoundingClientRect();
            const absoluteY = window.scrollY + elementRect.top;
        
            window.scrollTo({
                top: absoluteY - navbarHeight - margin, // Position proofCard under navbar with margin
                behavior: "smooth"
            });
        }
    }, 600);
}

function hideProof(){
    let proofCard= document.querySelector(".proof")
    proofCard.style.display="none"

    setTimeout(() => {
        window.scrollTo({
            top: initialScrollY,
            behavior: "smooth"
        });
    }, 50);
}


startQuiz()



let ham= document.querySelector(".ham")
let menu= document.querySelector(".menu")
let closeHam= document.getElementById("closeHam")

ham.addEventListener("click" ,function(){
    menu.style.display="flex"
})
closeHam.addEventListener("click" ,function(event){
    event.stopPropagation(); // Prevent the event from bubbling up
    menu.style.display = "none";
})


let newsletter= document.querySelector(".newsletter")
let form= document.querySelector(".formCont")

newsletter.addEventListener("click", function(){
    form.style.display="flex"
    
    setTimeout(() => {
        const navbarHeight = document.querySelector(".navbar")?.offsetHeight || 0; // Get navbar height
        const margin = 0; // Adjust margin as needed
    
        if (form) {
            const elementRect = form.getBoundingClientRect();
            const absoluteY = window.scrollY + elementRect.top;
            const viewportHeight = window.innerHeight;
    
            window.scrollTo({
                top: absoluteY - navbarHeight - margin - (viewportHeight / 2) + (elementRect.height / 2), 
                behavior: "smooth"
            });
        }
    }, 100);
})